% ************************************************************************ 
% Project Name :       
% Module       : *.m
% Software     : 
% Language     : M
% 
% Author       : wang.wei 
% Email        : wangwei3@topscomm.com  
% Telephone    : 
% Company      : ainuo
% Engineer     : fpgaer
% 
% Create Time  : 
%  
% ************************************************************************ 
% Module function:
%  
% 
% 
% 
% All Right Reserved 
% ************************************************************************ 
% Modification History:
% Date          By          Version          Change Description 
% ------------------------------------------------------------------------ 
%             Ainuo           1.0                Original       
% 
% ************************************************************************ 
function [sos, B, A] = vfloat2fix2(g, b, a, fpga_n)
% ========================================================================\
%     ****         Define Parameter and Internal Signals          **** 
% ========================================================================/





% ========================================================================\
%     ****                       Main Code                        ****  
% ========================================================================/
% 二阶基本节的数量
len = size(b, 1);
sos = zeros(len, 6);
Qb  = zeros(len, 3);
Qa  = zeros(len, 3);
% 理论上可以将增益分配给任意一个级联型IIR滤波器.
% 如果增益分配给第一级滤波器，则可能造成第一级滤波器输出的信号幅度较小，降低后续处理的精度.
% 如果增益分配给最后一级滤波器，则可能造成前级滤波器的增益较大，为确保运算结果不溢出，需要增加运算字长.
% 综合，将增益补偿平均分配给前两级滤波器.
g = sqrt(g);

% 量化
% 第一个基本节
[Qb(1,:), Qa(1,:)] = vfloat2fix(g * b(1,:), a(1,:), fpga_n);
sos(1,:) = [Qb(1,:), Qa(1,:)];

% 量化
% 第二个基本节
[Qb(2,:), Qa(2,:)] = vfloat2fix(g * b(2,:), a(2,:), fpga_n);
sos(2,:) = [Qb(2,:), Qa(2,:)];

% 其余基本节
for i = 3:len
    [Qb(i,:), Qa(i,:)] = vfloat2fix(b(i,:), a(i,:), fpga_n);
    sos(i,:) = [Qb(i,:), Qa(i,:)];
end

% 输出
B = Qb;
A = Qa;

end