% ************************************************************************ 
% Project Name :       
% Module       : *.m
% Software     : 
% Language     : M
% 
% Author       : wang.wei 
% Email        : wangwei3@topscomm.com  
% Telephone    : 
% Company      : ainuo
% Engineer     : fpgaer
% 
% Create Time  : 
%  
% ************************************************************************ 
% Module function:
%  
% 
% 
% 
% All Right Reserved 
% ************************************************************************ 
% Modification History:
% Date          By          Version          Change Description 
% ------------------------------------------------------------------------ 
%             Ainuo           1.0                Original       
% 
% ************************************************************************ 
% 函数说明: 系统函数系数量化
% b       : 离散系统函数的分子
% a       : 离散系统函数的分母
% fpga_n  : 量化位宽
% fix_b   : 已量化的分子
% fix_a   : 已量化的分母
function [fix_b, fix_a] = vfloat2fix(b, a, fpga_n)
% ========================================================================\
%     ****         Define Parameter and Internal Signals          **** 
% ========================================================================/





% ========================================================================\
%     ****                       Main Code                        ****  
% ========================================================================/

% 思路
% 1.所有系数均除以a(1)，确保a(1)的值为1.
% 2.找到最大绝对值(比如:2.2735)与a(1)的整数倍m(m=3).
% 3.找到最接近m的2^q，且2^q > m (q = 2).
% 4.量化. 所有系数乘以2^(fpga_n-1-q)，fpga_n为量化位宽.

a  = a/a(1);
b  = b/a(1);
m  = max(max(abs(a)), max(abs(b))); % 获取滤波器系数向量中绝对值最大的数
Qm = floor(log2(m/a(1))); % 取系数中最大值与a(1)的整数倍
if m > 2^Qm
    Qm = Qm + 1;
end
fix_b = round(b * (2 ^ (fpga_n - 1 - Qm)));
fix_a = round(a * (2 ^ (fpga_n - 1 - Qm)));

end