% ************************************************************************ 
% Project Name :       
% Module       : *.m
% Software     : 
% Language     : M
% 
% Author       : wang.wei 
% Email        : wangwei3@topscomm.com  
% Telephone    : 
% Company      : ainuo
% Engineer     : fpgaer
% 
% Create Time  : 
%  
% ************************************************************************ 
% Module function:
%  
% 
% 
% 
% All Right Reserved 
% ************************************************************************ 
% Modification History:
% Date          By          Version          Change Description 
% ------------------------------------------------------------------------ 
%             Ainuo           1.0                Original       
% 
% ************************************************************************ 
% 函数说明: 幅频响应曲线
% b       : 系统函数分子
% a       : 系统函数分母
% n       : 点数(影响频谱分辨率)
% fs      : 采样率
% y       : 幅频响应纵坐标(dB)
% x       : 幅频响应横坐标(Hz)
function [y, x] = vfreq(b, a, n, fs)
% ========================================================================\
%     ****         Define Parameter and Internal Signals          **** 
% ========================================================================/





% ========================================================================\
%     ****                       Main Code                        ****  
% ========================================================================/
% 单位脉冲响应
delta = [1, zeros(1, n)];

% 系统函数
Hz = filter(b, a, delta);

% 幅频响应纵坐标(dB)
y = 20 * log10(abs(fft(Hz)));

% 幅频响应横坐标(Hz)
x = [0:(fs/n):fs];

end