% ************************************************************************ 
% Project Name :       
% Module       : *.m
% Software     : 
% Language     : M
% 
% Author       : wang.wei 
% Email        : wangwei3@topscomm.com  
% Telephone    : 
% Company      : ainuo
% Engineer     : fpgaer
% 
% Create Time  : 
%  
% ************************************************************************ 
% Module function:
%  
% 
% 
% 
% All Right Reserved 
% ************************************************************************ 
% Modification History:
% Date          By          Version          Change Description 
% ------------------------------------------------------------------------ 
%             Ainuo           1.0                Original       
% 
% ************************************************************************ 
% 函数说明: CIC截位补偿
% R       : 抽取因子/插值因子
% M       : 差分单元
% N       : 阶数
% BIN     : 输入信号位宽
% BOUT    : 输出信号位宽
% type    : 类型'D'抽值'I'插值
% comp    : 补偿系数
function [comp] = vcomp(R, M, N, BIN, BOUT, type)
% ========================================================================\
%     ****         Define Parameter and Internal Signals          **** 
% ========================================================================/





% ========================================================================\
%     ****                       Main Code                        ****  
% ========================================================================/
if type == 'D'
    % 补偿增益
    db = 20*log10(2^(BOUT-BIN))-20*log10((R*M)^N);
    % 线性补偿
    linear = 10^(db/20);
    
else
    % 补偿增益
    db = 20*log10(2^(BOUT-BIN))-20*log10(((R*M)^N)/R);
    % 线性补偿
    linear = 10^(db/20);
end

% 输出
comp = linear;

end